Repository: AOSC-Tracking/grub-customizer
Catalog: translation/*.po
Languages: german

source: not found. Is grub2 installed?
german: nicht gefinden. Ist Grub2/BURG installiert?

source: couldn't be executed successfully. You must run this as root!
german: konnte nicht erfolgreich ausgeführt werden. Sie müssen dieses Programm als Admin ausführen!

source: _File
german: _Datei

source: _Edit
german: _Bearbeiten

source: _View
german: _Ansicht

source: _Help
german: _Hilfe

source: _Install to MBR …
german: Bootloader in den MBR _installieren …

source: Script to insert:
german: Einzufügendes Script:

source: Preview:
german: Vorschau:

source: Install the bootloader to MBR and put some files to the bootloaders data directory (if they don't already exist).
german: Dieser Dialog wird den Bootloader in den Master Boot Record übertragen. Ggf. werden einige Dateien im Daten-Verzeichnis des Bootloaders neu angelegt.

source: _Device:
german: _Gerät:

source: Grub Customizer is a graphical interface to configure the grub2/burg settings
german: Grub Customizer ist eine grafische Benutzeroberfläche zur Anpassung der grub2/burg-Einstellungen

source: Save configuration and generate a new
german: Konfiguration speichern und folgende Datei neu generieren:

source: Add a script to your configuration
german: Script zur Konfiguration hinzufügen

source: Remove a script from your configuration
german: Script aus der Konfiguration entfernen

source: Move up the selected entry or script
german: Aktuellen Eintrag / aktuelles Script eine Position nach oben schieben

source: Move down the selected entry or script
german: Aktuellen Eintrag / aktuelles Script eine Position nach unten schieben

source: reload configuration (same effect as an application restart)
german: Konfiguration erneut laden (gleicher Effekt wie bei Neustart des Programms)

source: Edit grub preferences
german: Grub-Einstellungen bearbeiten

source: Select _partition …
german: _Partition auswählen …

source: Add script
german: Script hinzufügen

source: Entry
german: Eintrag

source: Install to MBR
german: Bootloader in den MBR installieren

source: No Bootloader found
german: Es wurde kein Bootloader gefunden!

source: Do you want to select another root partition?
german: Möchten Sie eine andere Root-Partition auswählen?

source: BURG found!
german: BURG gefunden!

source: Do you want to configure BURG instead of grub2?
german: Wollen Sie statt Grub2 BURG konfigurieren?

source: The bootloader has been installed successfully
german: Der Bootloader wurde erfolgreich installiert!

source: Error while installing the bootloader
german: Installation des Bootloaders fehlgeschlagen

source: loading configuration…
german: Konfiguration wird geladen…

source: (custom)
german: (angepasst)

source: (new Entries)
german: (neue Einträge)

source: Proxy binary not found!
german: Proxy-Datei nicht gefunden!

source: You will see all entries (uncustomized) when you run grub. This error accurs (in most cases), when you didn't install grub gustomizer currectly.
german: Wenn Sie Grub das nächste mal starten, sehen Sie alle Einträge (unverändert).Dieser Fehler tritt in der Regel dann auf wenn der Grub Customizer nicht korrekt installiert wurde.

source: Configuration has been saved
german: Konfiguration gespeichert

source: updating configuration
german: Konfiguration wird aktualisiert

source: Name the Entry
german: Geben Sie eine Bezeichnung ein!

source: Default title:
german: Vorgabetitel:

source: No script found
german: Keine Skripte gefunden

source: The saved configuration is not up to date!
german: Die gespeicherte Konfiguration ist nicht aktuell!

source: The generated configuration didn't equal to the saved configuration on startup. So what you see now may not be what you see when you restart your pc. To fix this, click update!
german: Die generierte Konfiguration entsprach nicht der gespeicherten Konfiguration, als Sie dieses Programm gestartet haben. Dies kann dazu führen, dass die Anzeige im Bootloader nicht der Anzeige dieses Programms entspricht Um dieses Problem zu beheben, klicken Sie auf Aktualisieren!

source: _Quit without update
german: _Beenden, ohne zu aktualisieren

source: _Update & Quit
german: _Aktualisieren und Beenden

source: Do you want to save your modifications?
german: Sollen alle vorgenommenen Änderungen gespeichert werden?

source: _Quit without saving
german: _Beenden, ohne zu speichern

source: _Save & Quit
german: _Speichern und Beenden

source: installing the bootloader…
german: der Bootloaders wird installiert…

source: Please type a device string!
german: Bitte geben Sie einen Geräte-Pfad ein

source: is active
german: Aktiv

source: name
german: Bezeichnung

source: command not found, cannot proceed
german: -Befehl nicht gefunden. Grub Customizer kann nicht fortfahren

source: _use another partition:
german: _Andere Partition verwenden:

source: Mount selected Filesystem
german: Gewähltes Dateisystem einbinden

source: Unmount mounted Filesystem
german: Eingebundenes Dateisystem aushängen

source: These are the mountpoints of your fstab file. Please select every grub/boot related partition.
german: Diese Mountpoints befinden sich in Ihrer fstab. Bitte wählen Sie alle Partitionen, die zum Generieren der Grub-Konfiguration notwendig sind.

source: You started Grub Customizer using the live CD.
german: Sie haben den Grub Customizer von einer Live-CD aus gestartet.

source: You selected the option for choosing another partition. Please note: The os-prober may not find your actually running system. So run Grub Customizer on the target system again and save the configuration (or run update-grub/update-burg) to get the entry back!
german: Sie haben den Dialog zur Auswahl einer anderen Partition manuell gestartet. Bitte beachten Sie: Möglicherweise erkennt der os-prober das aktuell laufende System nicht. Sollte dies der Fall sein, führen Sie den Grub Customizer zusätzlich im Ziel-System aus und klicken Sie auf Speichern, um den Eintrag wiederherzustellen!

source: Before you can edit your grub configuration we have to mount the required partitions. This assistant will help you doing this. Please ensure the target system is based on the same cpu architecture as the actually running one. If not, you will get an error message when trying to load the configuration.
german: Bevor Sie Ihre Grub-Konfiguration bearbeiten können, müssen noch einige Partitionen eingebunden werden. Dieser Assistent wird Sie dabei unterstützen. Beachten Sie, dass das nur System bearbeitet werden können, welche die gleiche CPU-Architektur benutzen, wie das aktuell Laufende.

source: Grub Customizer: Partition chooser
german: Grub Customizer: Partitionsauswahl

source: Select and mount your root partition
german: Wählen Sie Ihre Root-Partition

source: type
german: Typ

source: label
german: Bezeichnung

source: Select required submountpoints
german: Wählen Sie alle notwendigen Mountpoints

source: Partition Chooser
german: Partitionsauswahl

source: Mount failed!
german: Partition konnte nicht eingebunden werden!

source: This seems not to be a root file system (no fstab found)
german: Bei dieser Partition scheint es sich nicht um ein Wurzeldateisystem zu handeln (fstab fehlt)

source: umount failed!
german: Partition konnte nicht ausgehängt werden

source: Couldn't mount the selected partition
german: Die ausgewählte Partition konnte nicht eingebunden werden

source: Couldn't umount the selected partition
german: Partition konnte nicht ausgehängt werden
