Repository: AOSC-Tracking/grub-customizer
Catalog: translation/translation-*.po
Languages: ast, lt

source: No script found
ast: Script nun atopáu
lt: Scenarijų nerasta

source: loading configuration…
ast: cargando configuración...
lt: įkeliama konfigūracija…

source: (custom)
ast: (personalizao)
lt: (pasirinktinis)

source: Configuration has been saved
ast: Los axustes foron atroxaos
lt: Nustatymai įrašyti

source: updating configuration
ast: Anovando axustes
lt: nustatymai atnaujinami

source: %1 not found. Is grub2 installed?
ast: Nun salcuentra %1. ¿Ta grub2 allugáu?
lt: %1 nerasta. Grub2 įdiegta?

source: %1 couldn't be executed successfully. error message: %2
ast: %1 nun pue ser executáu ensin torges. mensax d'erru: %2
lt: Sėkmingai įvykdyti %1 nepavyko. Klaidos pranešimas: %2

source: Name the Entry
ast: Nome d'Entrada
lt: Pavadinkite šį įrašą

source: cannot move this entry
ast: Nun pue ximelgase esta entrada
lt: perkelti įrašo nepavyko

source: Grub Customizer is a graphical interface to configure the grub2/burg settings
ast: Grub Customizer ye una interfaz gráfica pa remanar axustes de Grub2/burg
lt: Grub Customizer - tai grafinis įrankis skirtas grub2/burg konfigūravimui

source: Install the bootloader to MBR and put some files to the bootloaders data directory (if they don't already exist).
ast: Allugar el bootloader a MBR ya poner dalgunos archivos a los cartafueyos los bootloaders (si nun esisten yá).
lt: Įdiegti OS paleidimo programą į laikmenos MBR sektorių ir, jei reikia, sudėti reikalingus failus į OS paleidiklio duomenų aplanką.

source: _Device:
ast: _Preséu:
lt: Į_renginys:

source: Install to MBR
ast: Allugar a MBR
lt: Įdiegti į MBR sektorių

source: The bootloader has been installed successfully
ast: El bootloader foi allugáu
lt: OS paleidimo programa įdiegta sėkmingai

source: Error while installing the bootloader
ast: Erru entrín s'allugaba'l bootloader
lt: Įvyko klaida įdiegiant OS paleidimo programą

source: installing the bootloader…
ast: allugando'l bootloader
lt: įdiegiama OS paleidimo programa

source: Please type a device string!
ast: ¡Por favor escribi una cadena preseos!
lt: Nurodykite įrenginio failo pavadinimą!

source: _File
ast: _Ficheru
lt: _Failas

source: _Edit
ast: _Remanar
lt: _Keisti

source: _View
ast: _Güeyar
lt: _Rodymas

source: _Help
ast: _Aida
lt: _Žinynas

source: _Install to MBR …
ast: _Allugar a MBR...
lt: Į_diegti į MBR sektorių ...

source: BURG found!
ast: ¡BURG atopáu!
lt: Aptiktas BURG įkėliklis!

source: No Bootloader found
ast: Bootloader nun atopáu
lt: Neaptiktas Linux OS įkėliklis

source: Add a script to your configuration
ast: Añader un script a los tos axustes
lt: Pridėkite scenarijų į savo konfigūraciją

source: Remove a script from your configuration
ast: Esniciar un script dende los tos axustes
lt: Pašalinkite scenarijų iš konfigūracijos

source: Move up the selected entry or script
ast: Xubir pa enriba la entrada o script esbillaos
lt: Perkelkite aukštyn pasirinktą įrašą ar scenarijų

source: Move down the selected entry or script
ast: Baxar pa embaxo la entrada o script esbillaos
lt: Perkelkite žemyn pasirinktą įrašą ar scenarijų

source: remove this entry from the current submenu
ast: esniciar esta entrada del somenú d'aguaño
lt: pašalinti įrašą iš dabartinio submeniu

source: add this entry to a new submenu
ast: añader esta entrada al nuevu somenú
lt: pridėti šį įrašą į naują submeniu

source: reload configuration
ast: recargar axustes
lt: Įkelti nustatymus iš naujo

source: Edit grub preferences
ast: Editar axustes Grub
lt: Keisti įkėliklio GRUB nustatymus

source: Select _partition …
ast: Esbillar _partición ...
lt: Pasirinkite _skirsnį ...

source: Do you want to configure BURG instead of grub2?
ast: ¿Quiés configurar BURG en cuentes de grub2?
lt: Ar norėtumėte konfigūruoti įkėliklį BURG, o ne GRUB2?

source: Do you want to select another root partition?
ast: ¿Quiés esbillar otra partición?
lt: Ar norėtumėte pasirinkti kitą pagrindinį skirsnį?

source: BURG Mode
ast: Mou BURG
lt: BURG režimas

source: Save configuration and generate a new
ast: Atroxar axustes ya xenerar unu nuevu
lt: Įrašyti konfigūraciją ir sugeneruoti naują

source: Proxy binary not found!
ast: ¡Proxy binariu nun atopáu!
lt: Tarpinis serveris nerastas!

source: You will see all entries (uncustomized) when you run grub. This error accurs (in most cases), when you didn't install grub gustomizer currectly.
ast: Güeyarás toles entraes (non customizaes) cuando anicies Grub. Esti erru sal (na meyoría casos), cuando nun allugasti Grub Customizer correutamente
lt: Kai paleisite grub matysite visus įrašus(nederintus). Ši klaida dažniausiai įvyksta kai gustomizer įdiegtas neteisingai.

source: (new Entries of %1)
ast: (nueves Entraes de %1)
lt: (nauji įrašai iš %1)

source: (new Entries)
ast: (nueves Entraes)
lt: (nauji įrašai)

source: (script code)
ast: (códigu de script)
lt: (scenarijaus kodas)

source: Default title:
ast: Títulu per defeutu:
lt: Numatytasis pavadinimas:

source: The saved configuration is not up to date!
ast: ¡La configuración atroxada nun ta anovada!
lt: Išsaugoti nustatymai pasenę!

source: The generated configuration didn't equal to the saved configuration on startup. So what you see now may not be what you see when you restart your pc. To fix this, click update!
ast: Los axustes xeneraos nun tan iguaos a los atroxaos nel aniciu. Asina que lo que güeyes agora nun sedrá lo mesmo cuando reanicies el PC. Pa esclariar esti problema, ¡Primi n'anovar!
lt: Sugeneruoti nustatymai neatitinka paleidimo metu įrašytos konfigūracijos. Tai, ką matote dabar gali neatitikti realios situacijos, kurią matysite paleidę kompiuterį iš naujo. Norėdami tai pataisyti - spauskite „Atnaujinti“!

source: _Quit without update
ast: _Colar ensín anovar
lt: _Baigti neatnaujinant

source: _Update & Quit
ast: _Anovar ya Colar
lt: _Atnaujinti ir baigti

source: Do you want to save your modifications?
ast: ¿Quiés atroxar los tos cambeos?
lt: Ar norite įrašyti dabartinius pakeitimus?

source: _Quit without saving
ast: _Colar ensín atroxar
lt: _Baigti neišsaugant

source: _Save & Quit
ast: _Atoldar a Colar
lt: Į_rašyti ir baigti

source: AND: your modifications are still unsaved, update will save them too!
ast: YA: Les tos camudancies nun tan atoldaes enaina, ¡anovar atroxaralos tamién!
lt: TAIPOGI: jūsų pakeitimai vis dar nėra įrašyti, atnaujinimas tai padarytų!

source: is active
ast: Ta activu
lt: yra aktyvus

source: name
ast: viesu
lt: pavadinimas

source: _use another partition:
ast: _Usar otra partición
lt: _naudoti kitą skirsnį:

source: Mount selected Filesystem
ast: Montar el Filesystem esbilláu
lt: Prijungti pasirinktą failų sistemą

source: Unmount mounted Filesystem
ast: Desmontar el Filesystem esbilláu
lt: Atjungti pasirinktą failų sistemą

source: These are the mountpoints of your fstab file. Please select every grub/boot related partition.
ast: Estos son los puntos de montax del fstab. Por favor esbilla caunes les partciones Grub/boot.
lt: Tai yra jūsų „fstab“ failo prijungimo taškai. Pasirinkite visus grub/boot įrašus kurie susiję su skirsniu.

source: partition
ast: partición
lt: skirsnis

source: type
ast: triba
lt: tipas

source: label
ast: etiqueta
lt: antraštė

source: Grub Customizer: Partition chooser
ast: Grub Customizer: Esbillador de partición
lt: Grub Customizer: Skirsnio pasirinkimas

source: Select and mount your root partition
ast: Esbillar ya montar partición root
lt: Parinkite bei prijunkite pagrindinį sistemos skirsnį

source: Select required submountpoints
ast: Esbillar los puntos montax antemanaos requerios
lt: Pasirinkite reikiamus subprijungimo taškus

source: Partition Chooser
ast: Esbillador partición
lt: Skirsnių pasirinkimas

source: Mount failed!
ast: ¡Montax fallicu!
lt: Prijungimas nepavyko!

source: umount failed!
ast: ¡Desmotax fallicu!
lt: atjungimas nepavyko!

source: This seems not to be a root file system (no fstab found)
ast: Esto nun paez ser un sistema d'archivos (fstab nun atopáu)
lt: Tai tikriausiai nėra pagrindinė failų sistema (neaptiktas fstab)

source: Couldn't mount the selected partition
ast: Nun pue montase la partición esbillada
lt: Nepavyko prijungti parinkto skirsnio

source: Couldn't umount the selected partition
ast: Nun pue desmontase la partición esbillada
lt: Nepavyko atjungti parinkto skirsnio

source: You selected the option for choosing another partition. Please note: The os-prober may not find your actually running system. So run Grub Customizer on the target system again and save the configuration (or run update-grub/update-burg) to get the entry back!
ast: Esbillasti la opción pa esbillar otra partición. Nota: El os-prober nun pue alcontrar anguaño'l sistema. ¡Asina qu'anicia Grub Customizer nel sistema destín otra vegada ya atroxa los axustes (o anicia update-grub/update-burg) pa consiguir la entrada!
lt: Pasirinkote parinkty kito skirsnio pasirinkimui. Pastaba: os-prober gali nerasti jūsų sistemos. Taigi norėdami vėl matyti įrašą dar kartą paleiskite Grub Customizer paskirties sistemoje ir išsaugokite nustatymus (arba įvykdykite update-grub/update-burg)

source: You started Grub Customizer using the live CD.
ast: Entamasti Grub Customizer pel live CD.
lt: Paleidote Grub Customizer iš demonstracinės (live) laikmenos.

source: Before you can edit your grub configuration we have to mount the required partitions. This assistant will help you doing this. Please ensure the target system is based on the same cpu architecture as the actually running one. If not, you will get an error message when trying to load the configuration.
ast: Enantes camudar axustes de Grub tenemos que montar le particiones precises. Esti asistente aidarate faciendo esto. Afítate de la arquitectura del sistema destín na qu'anguaño furrula. Si non, consiguirás un mensax d'erru entrín pruebes cargar los axustes.
lt: Norint redaguoti grub konfigūraciją reikia prijungti reikiamus skirsnius. Šis vedlys padės tai padaryti. Įsitikinkite jog paskirties sistema naudoja tokią pačią cpu architektūrą kaip ir veikianti. Jei skiriasi, įkeliant konfigūraciją gausite klaidos pranešimą.

source: Script to insert:
ast: Script a enxertar
lt: Scenarijus kurį įterpti:

source: Preview:
ast: Previsualizar:
lt: Peržiūra:

source: Add script
ast: Añader script
lt: Pridėti scenarijų

source: Entry
ast: Entrada
lt: Įrašas

source: white
ast: blancu
lt: balta

source: yellow
ast: mariellu
lt: geltona

source: light-cyan
ast: cian claro
lt: šviesiai žydra

source: cyan
ast: cian
lt: žydra

source: light-blue
ast: azul claro
lt: šviesiai mėlyna

source: blue
ast: azul
lt: mėlyna

source: light-green
ast: verde claro
lt: šviesiai žalia

source: green
ast: verde
lt: žalia

source: light-magenta
ast: maxenta claro
lt: šviesiai purpurinė

source: magenta
ast: maxenta
lt: purpurinė

source: light-red
ast: bermeyu claro
lt: šviesiai raudona

source: red
ast: bermeyu
lt: raudona

source: brown
ast: castañu
lt: ruda

source: light-gray
ast: grai claro
lt: šviesiai pilka

source: dark-gray
ast: grai escuro
lt: tamsiai pilka

source: transparent
ast: tresparente
lt: permatoma

source: black
ast: prietu
lt: juoda

source: pre_defined:
ast: pre_definío
lt: _numatytasis:

source: previously _booted entry
ast: Entrada aniciada _postreramente
lt: _paskutinis pasirinktas elementas

source: default entry
ast: entrada per defeutu
lt: numatytasis elementas

source: visibility
ast: visibilidá
lt: matomumas

source: show menu
ast: amosar menú
lt: rodyti meniu

source: Timeout
ast: Tiempu llímite
lt: Laiko limitas

source: Seconds
ast: Segundos
lt: sek.

source: kernel parameters
ast: Parametros kernel
lt: branduolio parametrai

source: generate recovery entries
ast: xenerar entraes recuperaes
lt: generuoti atkūrimo įrašus

source: look for other operating systems
ast: restolar per otros sistemas
lt: ieškoti kitų operacinių sistemų

source: custom resolution:
ast: otra resolución:
lt: pasirinktinė raiška:

source: font color
ast: color fonte
lt: šrifto spalva

source: background
ast: fondu
lt: fonas

source: normal:
lt: įprastas:

source: highlight:
ast: señalar:
lt: ryškus:

source: menu colors
ast: colores menú
lt: meniu spalvos

source: background image
ast: semeya de fondu
lt: fono paveikslėlis

source: To get the colors above working, you have to select a background image!
ast: ¡Pa consiguir colores enriba que trabayen tienes qu'esbillar una semeya de fondu!
lt: Norint jog aukščiau esančios spalvos veiktų, turite pasirinkti fono paveikslėlį!

source: _Font
lt: Šri_ftas

source: settings
ast: axustes
lt: nustatymai

source: _General
ast: _Xeneral
lt: _Bendra

source: A_ppearance
ast: _Aspeutu
lt: _Išvaizda

source: _Advanced
ast: _Avanzao
lt: _Papildoma

source: value
ast: Valor
lt: reikšmė

source: saved
lt: išsaugota

source: remove font
lt: pašalinti šriftą

source: remove background
ast: esniciar fondu
lt: pašalinti foną

source: Entry %1 (by position)
ast: Entrada %1 (per posición)
lt: Įrašas %1 (pagal vietą)

source: This option doesn't work when the "os-prober" script finds other operating systems. Disable "%1" if you don't need to boot other operating systems.
ast: Esta opción nun furrula cuando'l script "os-prober" atopa otros sistemes. Desanicia "%1" si necesites aniciar otros sistemes.
lt: Ši parinktis neveikia kai „os-prober“ scenarijus randa kitų operacinių sistemų. Išjunkite „%1“ jei nenorite įkrauti kitų operacinių sistemų.
